Revit 2027 API
ExternallyTaggedNonBReps.Add Method
 Adds a copy of the input ExternallyTaggedNonBRep to this collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Add(
	ExternallyTaggedNonBRep geometry
)
Public Sub Add (
	geometry As ExternallyTaggedNonBRep
)
public:
void Add(
	ExternallyTaggedNonBRep^ geometry
)
member Add :
        geometry : ExternallyTaggedNonBRep -> unit
Parameters
geometry ExternallyTaggedNonBRep
 The ExternallyTaggedNonBRep to be added.
Exceptions
Exception | Condition
ArgumentException |  The ExternalGeometryId of geometry already exists in this collection.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace